{
  "backend/main.mo": "Primary Motoko canister defining the core actor, domain types (users, blueprints, marketplace, social, progress), storage and authorization mixins, Stripe integration, HTTP outcalls, and migration hook for evolving data.",
  "backend/migration.mo": "Migration module that transforms stored marketplace blueprints to a new schema by adding an empty tags array while preserving existing data.",
  "feature_evidence.json": "Generated feature evidence report documenting implemented features, affected frontend files, component versions, test requirements, and confidence levels, primarily around marketplace tags and search enhancements.",
  "frontend-file-summaries.txt": "Prewritten summaries of most frontend source files, describing routing, pages, components, hooks, and UI behavior across the application.",
  "frontend/index.css": "Global Tailwind CSS configuration defining design tokens, color themes (light/dark), and base styles for the frontend.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React application and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router routes, global layout, loading screen, and toast notifications.",
  "frontend/src/components/BlockBasedBlueprintBuilder.tsx": "Empty or placeholder component file intended for a block-based blueprint builder UI.",
  "frontend/src/components/ConnectionStatus.tsx": "UI component that monitors backend actor connection state and displays animated connection, success, retry, and error alerts.",
  "frontend/src/components/CustomBlueprintCreation.tsx": "Empty or placeholder component file intended for custom blueprint creation functionality.",
  "frontend/src/components/DailyTasks.tsx": "Empty or placeholder component file intended for rendering daily task checklists.",
  "frontend/src/components/Flashcard.tsx": "Empty or placeholder component file intended for an interactive flashcard-style UI component.",
  "frontend/src/components/Header.tsx": "Top navigation header handling authentication state, login/logout, and a hamburger dropdown with links and gated features that trigger a sign-in prompt when unauthenticated.",
  "frontend/src/components/Layout.tsx": "App layout wrapper that renders the Header, connection status, tab navigation, and an outlet for routed page content.",
  "frontend/src/components/LoadingScreen.tsx": "Full-screen animated loading/splash screen with blueprint-themed visual effects that fades out and calls a completion callback after a timed animation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time profile creation, collecting username and bio and saving the profile via a mutation with validation and toast feedback.",
  "frontend/src/components/ProgressTracking.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/SignInPrompt.tsx": "Reusable modal prompting users to sign in with Internet Identity, explaining benefits and handling login success, cancellation, and error states.",
  "frontend/src/components/StepBasedBlueprintBuilder.tsx": "Large interactive builder for creating step-based blueprints with draggable steps and blocks, theming, preview/publish flow, and publishing metadata like price, tags, and images.",
  "frontend/src/components/TabNavigation.tsx": "Sticky horizontal tab bar that renders primary app navigation tabs and highlights the active route using router location.",
  "frontend/src/components/TemplateBlueprintCreation.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/TestModeIndicator.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/TestModeLogin.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/WeeklyTimeline.tsx": "React component that renders a weekly phase timeline card, filtering predefined phases based on the number of weeks and displaying them with icons, gradients, and week ranges.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor using React Query, handling authenticated vs anonymous identities and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useActorConnection.ts": "Wrapper hook around useActor that tracks connection status, retry attempts, error states, and whether the actor is currently retrying or connected.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for Internet Identity authentication, managing AuthClient setup, login/logout, identity persistence, and detailed login status flags.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, posts, and related data, with backend readiness checks and fallback to demo data when unavailable.",
  "frontend/src/hooks/useTestMode.tsx": "Empty placeholder file with no implementation or exports.",
  "frontend/src/index.css": "Tailwind CSS base file defining design tokens and CSS variables for light and dark themes, including colors, borders, and layout primitives.",
  "frontend/src/lib/demoData.ts": "Provides demo-mode flag and static mock data for users, posts, blueprints, comments, and reviews to be used when the backend is unavailable or in development.",
  "frontend/src/lib/demoInteractions.ts": "Implements local-only demo interactions (likes, comments, purchases) stored in sessionStorage, with helpers to detect demo posts/blueprints and manage counts and user actions.",
  "frontend/src/main.tsx": "Application entry point that renders the React app, wiring up React Query and Internet Identity providers.",
  "frontend/src/pages/BlueprintDetailsPage.tsx": "Displays marketplace blueprint details with purchase and review functionality, handling both real backend interactions and local demo purchases/reviews with authentication gating.",
  "frontend/src/pages/BlueprintPage.tsx": "Empty placeholder file for a blueprint page, with no implementation yet.",
  "frontend/src/pages/ChatPage.tsx": "Chat landing page that requires authentication and shows placeholder UI for direct messages and group chats once signed in.",
  "frontend/src/pages/ChecklistsPage.tsx": "Empty placeholder file for a checklists page, with no implementation yet.",
  "frontend/src/pages/ExplorePage.tsx": "Provides search across posts and blueprints with simulated results and displays computed trending topics based on existing posts.",
  "frontend/src/pages/FeedPage.tsx": "Empty placeholder file for a feed page, with no implementation yet.",
  "frontend/src/pages/HomePage.tsx": "Main social feed page for creating posts, liking, and commenting, integrating backend queries and local demo interactions for demo posts with authentication prompts.",
  "frontend/src/pages/LandingPage.tsx": "Public marketing landing page introducing the Blueprint platform with a call-to-action and placeholder toast for blueprint creation.",
  "frontend/src/pages/MarketplacePage.tsx": "Implements the marketplace UI to browse, search, sort, view, and purchase blueprints, handling demo vs real purchases, authentication prompts, and navigation to detail pages.",
  "frontend/src/pages/MessagesPage.tsx": "This file is currently empty or unimplemented, serving as a placeholder for a future messages page.",
  "frontend/src/pages/MyBlueprintsPage.tsx": "Displays a signed-in user's created and purchased blueprints using tabs, with sign-in gating and calls to action when no data exists.",
  "frontend/src/pages/NotificationsPage.tsx": "Renders a notifications feed (currently mock data) with authentication checks, profile setup gating, and UI for different notification types.",
  "frontend/src/pages/ProfilePage.tsx": "Shows a user profile with follow/unfollow functionality, handling own vs other profiles, authentication prompts, loading states, and profile retrieval by principal ID.",
  "frontend/src/pages/StudioPage.tsx": "Provides the Blueprint Studio for creating step-based blueprints, gated by authentication and profile setup, and embeds the step-based builder component.",
  "frontend/src/types/index.ts": "Defines shared TypeScript interfaces for core domain models such as users, posts, comments, blueprints, marketplace items, reviews, and related metadata.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters from query strings or hash-based routing, persist them in sessionStorage, and retrieve or clear them across navigation. Includes helpers for safely storing, retrieving, and removing sensitive parameters (e.g., admin tokens) without page reloads.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, container settings, and extensive theme extensions for colors, radii, shadows, and animations using CSS variables. Registers typography, container queries, and animation plugins.",
  "project_state.json": "Machine-readable snapshot of the project blueprint describing the app’s architecture, feature set, and backend/frontend capabilities, with versioning metadata. Enumerates existing features such as authentication, actor setup, role-based access control, demo mode, and social/marketplace functionality."
}