{
  "backend/main.mo": "Defines the actor canister’s core data models for blueprints, posts, users, tasks, milestones, ownership records, and storage integration.",
  "feature_evidence.json": "Feature evidence report listing features, affected files, components, and related test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of multiple frontend files across pages, hooks, and components.",
  "frontend/index.css": "Tailwind base stylesheet defining light/dark mode OKLCH color variables and global element styles.",
  "frontend/index.html": "Basic HTML entry file mounting the app root and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all primary routes, global layout, loading screen, and toaster notifications.",
  "frontend/src/components/BlockBasedBlueprintBuilder.tsx": "Empty placeholder component file.",
  "frontend/src/components/ConnectionStatus.tsx": "UI component showing live connection state, success, retry, and error banners for backend connectivity.",
  "frontend/src/components/CustomBlueprintCreation.tsx": "Empty placeholder component file.",
  "frontend/src/components/DailyTasks.tsx": "Empty placeholder component file.",
  "frontend/src/components/Flashcard.tsx": "Empty placeholder component file.",
  "frontend/src/components/Header.tsx": "Header with authentication controls, navigation menu, and sign‑in prompts for gated actions.",
  "frontend/src/components/Layout.tsx": "Defines the main app layout with header, connection status, tab navigation, and routed content.",
  "frontend/src/components/LoadingScreen.tsx": "Displays an animated loading screen with timed fade-out and calls onComplete afterward.",
  "frontend/src/components/OfflineModeNotice.tsx": "Shows an alert indicating the user is offline and data will be saved locally.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile with username and bio, submitting via a mutation.",
  "frontend/src/components/ProgressTracking.tsx": "Empty placeholder component.",
  "frontend/src/components/SignInPrompt.tsx": "Dialog prompting users to sign in via Internet Identity with feature highlights and error handling.",
  "frontend/src/components/StepBasedBlueprintBuilder.tsx": "Complex builder UI for creating step-based blueprints with editable steps, blocks, themes, and publishing flow.",
  "frontend/src/components/TabNavigation.tsx": "Renders the top tab navigation bar with icons and active route highlighting.",
  "frontend/src/components/TemplateBlueprintCreation.tsx": "Empty placeholder component.",
  "frontend/src/components/TestModeIndicator.tsx": "Empty placeholder component.",
  "frontend/src/components/TestModeLogin.tsx": "Empty placeholder component.",
  "frontend/src/components/WeeklyTimeline.tsx": "Displays a week-based progress timeline showing phases and milestones up to the selected week.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance using react-query, refreshing it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useActorConnection.ts": "Tracks actor connection state, retries, and errors, providing connection status indicators based on useActor.",
  "frontend/src/hooks/useCalendarData.ts": "Fetches project blueprints created by the current user and provides a mutation to toggle local task completion state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, exposing identity, login, and logout while loading and validating stored delegations.",
  "frontend/src/hooks/useQueries.ts": "Provides multiple data-fetching and mutation hooks for profiles, posts, and other backend resources with demo-data fallbacks.",
  "frontend/src/hooks/useTestMode.tsx": "Empty placeholder file for future Test Mode logic.",
  "frontend/src/index.css": "Defines global Tailwind layers and CSS variables for themes, including light and dark mode color tokens.",
  "frontend/src/lib/calendarTasks.ts": "Generates derived tasks from blueprint blocks and manages task completion via localStorage with parsing helpers.",
  "frontend/src/lib/demoData.ts": "Provides demo-mode helpers along with mock users and posts used when the backend is unavailable.",
  "frontend/src/lib/demoInteractions.ts": "Implements local-only likes, comments, and purchases for demo posts and blueprints using sessionStorage.",
  "frontend/src/lib/localPublishedBlueprints.ts": "Manages storing, serializing, and retrieving locally published blueprints in localStorage.",
  "frontend/src/lib/taskCompletionStorage.ts": "Stores and toggles enabled blueprint preferences for calendar tasks in localStorage.",
  "frontend/src/lib/utils.ts": "Exports a utility to merge Tailwind and class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/BlueprintDetailsPage.tsx": "Displays blueprint details and handles purchases, reviews, and demo-mode logic based on ownership.",
  "frontend/src/pages/BlueprintPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/CalendarPage.tsx": "Shows a task calendar that derives daily tasks from owned blueprints and lets users toggle completion.",
  "frontend/src/pages/ChatPage.tsx": "Renders a chat interface with sign‑in gating and tabs for direct and group messages, showing placeholder states when empty.",
  "frontend/src/pages/ChecklistsPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/ExplorePage.tsx": "Provides search across posts and blueprints, displays trending topics, and includes navigation to the marketplace.",
  "frontend/src/pages/FeedPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/HomePage.tsx": "Displays the main feed with post creation, likes, comments, and demo interaction support, with sign‑in restrictions for actions.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page highlighting platform features and prompting users to start building a blueprint.",
  "frontend/src/pages/MarketplacePage.tsx": "Shows searchable and sortable marketplace blueprints with purchase handling for both real and demo items.",
  "frontend/src/pages/MessagesPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/MyBlueprintsPage.tsx": "Shows a user's created and purchased blueprints with sign‑in gating and offline handling.",
  "frontend/src/pages/NotificationsPage.tsx": "Renders a notifications list using mock data, handling authentication, profile setup, and timestamp formatting.",
  "frontend/src/pages/ProfilePage.tsx": "Displays a user's profile with follow/unfollow actions, authentication checks, loading states, and navigation handling.",
  "frontend/src/pages/StudioPage.tsx": "Provides an authenticated blueprint creation interface with a step-based builder and prompts for sign-in or profile setup.",
  "frontend/src/types/index.ts": "Defines TypeScript interfaces for user profiles, posts, comments, blueprints, themes, and reviews.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theming, colors, animations, and plugin integration for the frontend.",
  "project_state.json": "Defines the project’s schema and a detailed list of existing features covering authentication, actor setup, RBAC, routing, profile management, social features, marketplace, blueprint studio, calendar logic, and backend utilities. Serves as a comprehensive snapshot of current app capabilities for planning."
}