{
  "kind": "build_request",
  "title": "Fix purchased blueprints not appearing in My Blueprints → Purchased after buying",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix demo-vs-real blueprint detection so that real, user-created marketplace blueprints are not treated as demo blueprints during purchase/ownership flows, ensuring that purchasing a real blueprint calls the backend purchase API and can therefore appear in My Blueprints → Purchased.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the blueprints should show up in the my blueprints tab under purchased after you buy them"
        ]
      },
      "acceptanceCriteria": [
        "A blueprint created/published by a signed-in user (online publish) is NOT classified as a demo blueprint solely because its ID starts with \"blueprint-\".",
        "When clicking Buy/Get on a real marketplace blueprint, the app calls the backend `purchaseBlueprint(blueprintId)` mutation rather than recording a sessionStorage demo purchase.",
        "Blueprint ownership checks for real marketplace blueprints use backend ownership (`checkBlueprintOwnership`) and not session demo ownership."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure that after a successful real purchase, the My Blueprints page shows the purchased blueprint under the Purchased tab (without requiring a hard refresh), by making sure the owned-blueprints query state is refreshed and the Purchased list is derived from the refreshed owned records.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the blueprints should show up in the my blueprints tab under purchased after you buy them"
        ]
      },
      "acceptanceCriteria": [
        "Immediately after purchasing a real blueprint and navigating to My Blueprints → Purchased, the purchased blueprint appears in the list.",
        "The Purchased tab shows purchased items based on backend `getOwnedBlueprints()` results merged against the marketplace blueprint list (as it does today), and updates when the owned-blueprints query is invalidated/refetched."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain single-actor (all Motoko logic in backend/main.mo); only add migration if state schema changes are required."
  ],
  "nonGoals": [
    "Do not redesign the Marketplace or My Blueprints UI beyond what is necessary to make purchased items appear correctly.",
    "Do not add new authentication methods beyond Internet Identity.",
    "Do not introduce new storage layers or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}