{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix real marketplace blueprint purchases and Purchased list refresh",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Correct demo-vs-real blueprint classification so real marketplace blueprints use backend purchase/ownership flows instead of sessionStorage demo flows.",
      "acceptanceCriteria": [
        "A blueprint created/published by a signed-in user (online publish) is NOT classified as a demo blueprint solely because its ID starts with \"blueprint-\".",
        "When clicking Buy/Get on a real marketplace blueprint, the app calls the backend `purchaseBlueprint(blueprintId)` mutation rather than recording a sessionStorage demo purchase.",
        "Blueprint ownership checks for real marketplace blueprints use backend ownership (`checkBlueprintOwnership`) and not session demo ownership."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/demoInteractions.ts",
          "operation": "modify",
          "description": "Redefine `isDemoBlueprint(blueprintId)` to classify demo blueprints by membership in the known demo blueprint set (sourced from demo data) rather than by the `blueprint-` prefix, so real user-published IDs like `blueprint-<timestamp>` are treated as real purchases."
        },
        {
          "path": "frontend/src/pages/MarketplacePage.tsx",
          "operation": "modify",
          "description": "Ensure the Buy/Get flow only uses sessionStorage demo purchase logic when `isDemoBlueprint` returns true under the new classification; all other marketplace blueprints must use the backend purchase mutation path."
        },
        {
          "path": "frontend/src/pages/BlueprintDetailsPage.tsx",
          "operation": "modify",
          "description": "Ensure ownership checks and purchase logic treat only true demo blueprints as demo: for real marketplace blueprints, use backend ownership via `useCheckBlueprintOwnership` and backend purchase via `usePurchaseBlueprint`, not session demo ownership/purchase."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Refresh owned-blueprints query state after real purchase so My Blueprints → Purchased updates immediately without hard refresh.",
      "acceptanceCriteria": [
        "Immediately after purchasing a real blueprint and navigating to My Blueprints → Purchased, the purchased blueprint appears in the list.",
        "The Purchased tab shows purchased items based on backend `getOwnedBlueprints()` results merged against the marketplace blueprint list (as it does today), and updates when the owned-blueprints query is invalidated/refetched."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update `usePurchaseBlueprint` success handling to aggressively refresh ownership-driven UI by invalidating and refetching the owned-blueprints query (and related ownership query keys) so navigation to My Blueprints shows newly purchased items without requiring a hard refresh."
        },
        {
          "path": "frontend/src/pages/MyBlueprintsPage.tsx",
          "operation": "modify",
          "description": "Confirm Purchased tab list is derived from the latest `useGetOwnedBlueprints()` records merged against the current marketplace blueprint list, and trigger a lightweight refresh when the page is visited/when backend becomes ready so newly purchased items appear immediately."
        }
      ]
    }
  ]
}