{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Blueprint is a full-stack Internet Computer (Motoko) + React application combining a social feed with a marketplace for publishing and purchasing “blueprints” (step-based plans). Users authenticate with Internet Identity, set up profiles, browse/create/like/comment on posts, follow other users, browse marketplace blueprints (with demo and offline fallbacks), purchase blueprints (with ownership checks), and leave reviews (ownership-gated). The Studio provides a step-based blueprint builder (steps + multiple block types) that can publish online to the canister or save locally when offline; locally published marketplace metadata is merged into the marketplace and “My Blueprints” views. A Calendar page derives per-day tasks from blueprint blocks (dailyStep and checklist) and stores completion state in localStorage. The backend also includes RBAC authorization, Stripe checkout via HTTPS outcalls, and blob-storage utilities.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication context",
      "synonyms": [
        "II auth",
        "AuthClient provider"
      ],
      "description": "Provides an authentication context (`InternetIdentityProvider` + `useInternetIdentity`) built on `@dfinity/auth-client`, including login/logout, loading stored delegations, and status flags (initializing/logging-in/success/error).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Backend actor creation (anonymous and authenticated) with query rebinding",
      "synonyms": [
        "useActor",
        "canister actor bootstrap"
      ],
      "description": "Creates an anonymous actor for guests and an authenticated actor (identity-attached) for signed-in users. After actor creation, invalidates/refetches non-actor React Query caches so data binds to the latest actor/identity.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Role-based access control (admin/user/guest) with initialization secret",
      "synonyms": [
        "RBAC",
        "AccessControl"
      ],
      "description": "Motoko access-control layer registers users and optionally assigns the first admin based on an environment-provided admin token; exposes role queries and admin-only role assignment.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Connection status UI with retry/error states",
      "synonyms": [
        "ConnectionStatus",
        "useActorConnection"
      ],
      "description": "Tracks actor connectivity and displays connecting/reconnecting banners with retry counts, a transient success banner on reconnection, and an error banner after repeated failures (with a reload-based retry action).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "App routing and layout with tab navigation",
      "synonyms": [
        "TanStack Router",
        "Layout + TabNavigation"
      ],
      "description": "Defines routes for Home, Explore, Marketplace, Blueprint Details, Calendar, Notifications, Chat, My Blueprints, Studio, and Profile, with a shared layout (Header + ConnectionStatus + tab bar + routed outlet).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "User profiles: fetch/save and onboarding modal",
      "synonyms": [
        "getCallerUserProfile",
        "saveCallerUserProfile",
        "ProfileSetupModal"
      ],
      "description": "Implements profile fetching for the caller and arbitrary principals, profile saving for the caller, and a first-time setup modal that collects username/bio and persists the profile via mutation with validation/toasts.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Social feed: posts listing with demo fallback",
      "synonyms": [
        "getPosts",
        "demoPosts fallback"
      ],
      "description": "Fetches posts from the canister when available; if backend is unavailable or the method is missing, displays seeded demo posts so the feed remains usable.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Create post (authenticated) with optional blueprint attachment",
      "synonyms": [
        "createPost",
        "post composer"
      ],
      "description": "Allows authenticated users to create a post (optionally attaching a marketplace blueprint id) and invalidates the posts query on success; displays user-friendly errors when backend/auth is not ready.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Like/unlike posts with optimistic updates",
      "synonyms": [
        "likePost",
        "post reactions"
      ],
      "description": "Implements like/unlike via backend mutation with optimistic React Query cache updates, rollback on error, and actionable toast messages for common failure causes (not connected / not authenticated).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Comments: list and add comments with demo fallback",
      "synonyms": [
        "getComments",
        "addComment"
      ],
      "description": "Fetches comments per post (demo fallback when backend is unavailable) and allows authenticated users to add comments, invalidating posts and comment queries on success.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Demo interactions stored client-side for demo content",
      "synonyms": [
        "session demo mode",
        "demo likes/comments/purchases"
      ],
      "description": "Stores likes, comments, and purchases for demo posts/blueprints in sessionStorage, allowing interactive demo behavior without backend writes (including demo ownership states).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Follow and unfollow users",
      "synonyms": [
        "social graph",
        "followUser/unfollowUser"
      ],
      "description": "Provides auth-gated mutations to follow/unfollow other principals and invalidates relevant profile queries after updates; Profile UI exposes follow/unfollow for non-self profiles.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Marketplace blueprint listing with merge (backend + demo + local)",
      "synonyms": [
        "getMarketplaceBlueprints",
        "offline marketplace"
      ],
      "description": "Lists marketplace blueprints from the backend when available and merges in demo blueprints and locally published blueprints (deduped by id), enabling browsing offline or when backend methods are missing.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Marketplace search/sort and blueprint details view",
      "synonyms": [
        "MarketplacePage",
        "BlueprintDetailsPage"
      ],
      "description": "Marketplace supports search across description/id/tags and sorting (recent/price). Details view shows theme-styled banner/image, pricing, ownership state, purchase button, and reviews.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Purchases and ownership (purchase, ownership check, owned list) + My Blueprints purchased tab",
      "synonyms": [
        "purchaseBlueprint",
        "checkBlueprintOwnership",
        "getOwnedBlueprints",
        "MyBlueprintsPage Purchased"
      ],
      "description": "Backend supports purchasing marketplace blueprints and storing per-user ownership records; frontend can check ownership for a given blueprint, fetch owned blueprint records, and display purchased blueprints by joining ownership records to marketplace metadata.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Reviews: list and submit reviews (ownership-gated)",
      "synonyms": [
        "getReviews",
        "addReview"
      ],
      "description": "Fetches reviews per blueprint (demo fallback when backend unavailable) and allows authenticated owners to submit reviews; backend enforces ownership before accepting a review.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Step-based blueprint builder (Studio)",
      "synonyms": [
        "StepBasedBlueprintBuilder",
        "project blueprint editor"
      ],
      "description": "Interactive builder for creating step-based blueprints with steps and block types (text, question, dropdown, checklist, dailyStep), step/block drag-and-drop, duplication/deletion, preview mode, tags, theme selection/custom colors, and optional image/banner uploads.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Blueprint publishing: online to backend or offline to localStorage",
      "synonyms": [
        "createProjectBlueprint",
        "createMarketplaceBlueprint",
        "offline local publish"
      ],
      "description": "When online, publishes a ProjectBlueprintView and MarketplaceBlueprint to the canister (including images as ExternalBlob). When offline (no actor), saves a serializable marketplace blueprint subset locally and merges it into marketplace/created lists with event-driven refresh.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Locally published blueprint storage utilities",
      "synonyms": [
        "localPublishedBlueprints",
        "local-blueprint-published event"
      ],
      "description": "Provides BigInt/Principal-safe serialization/deserialization for locally published marketplace blueprints in localStorage, dedupes by id, and emits a custom browser event to invalidate React Query caches immediately.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Project blueprint storage and retrieval (backend) + caller-scoped calendar feed",
      "synonyms": [
        "projectBlueprints",
        "getProjectBlueprints"
      ],
      "description": "Backend stores project blueprints as maps of steps/blocks and exposes a view format for retrieval. Frontend fetches project blueprints and filters to those created by the caller for calendar/task usage.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Calendar: derive daily tasks from blueprint blocks with local completion",
      "synonyms": [
        "deriveTasksForDate",
        "calendar task completion"
      ],
      "description": "Derives tasks for a selected date from `dailyStep` and `checklist` blocks (JSON-parsed content with fallbacks) and stores completion state in localStorage keyed by date; toggles completion via a React Query mutation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Stripe checkout integration via IC HTTPS outcalls",
      "synonyms": [
        "createCheckoutSession",
        "getStripeSessionStatus"
      ],
      "description": "Backend supports admin-configured Stripe credentials and user-scoped creation of checkout sessions and status queries using IC HTTPS outcalls with a transform function that strips headers and explicit cycle allocation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Blob-storage gateway utilities and dead-blob pruning",
      "synonyms": [
        "caffeine storage mixin",
        "authorized gateway principals"
      ],
      "description": "Backend includes a storage mixin for updating authorized gateway principals, listing dead blobs (authorized callers only), confirming deletion (with GC trigger), and refilling a cashier canister with cycles (env-var configured).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Direct messaging storage APIs (participant-gated)",
      "synonyms": [
        "sendMessage/getMessages",
        "DM APIs"
      ],
      "description": "Backend stores per-conversation messages and exposes query/mutation APIs that enforce the caller is a participant in the conversation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Personal weight-loss data APIs (backend)",
      "synonyms": [
        "saveBlueprint/getBlueprint",
        "daily tasks/weight/progress"
      ],
      "description": "Backend includes user-scoped storage APIs for a personal blueprint object, daily task records, weight entries, and progress snapshots with RBAC enforcement.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-fix-demo-vs-real-blueprint-detection-so-that-real-user-created-marketplace-blueprints-are-not-treated-as-demo-blueprints-during-purchase-ownership-flows-ensuring-that-purchasing-a-real-blueprint-calls-the-backend-purchase-api-and-can-therefore-appear-in-my-blueprints-purchased",
      "title": "Fix demo-vs-real blueprint detection so that real, user-created marketplace blueprints are not treated as demo blueprints during purchase/ownership flows, ensuring that purchasing a real blueprint calls the backend purchase API and can therefore appear in My Blueprints → Purchased.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-that-after-a-successful-real-purchase-the-my-blueprints-page-shows-the-purchased-blueprint-under-the-purchased-tab-without-requiring-a-hard-refresh-by-making-sure-the-owned-blueprints-query-state-is-refreshed-and-the-purchased-list-is-derived-from-the-refreshed-owned-records",
      "title": "Ensure that after a successful real purchase, the My Blueprints page shows the purchased blueprint under the Purchased tab (without requiring a hard refresh), by making sure the owned-blueprints query state is refreshed and the Purchased list is derived from the refreshed owned records.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Ensure Marketplace purchases appear in My Blueprints → Purchased immediately after buying (ownership/library UI correctly reflects purchase state).",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend is React + TypeScript using TanStack Router for routing and TanStack React Query for caching, mutations, optimistic updates, and invalidation.",
    "Canister access is abstracted behind a `useActor` hook that creates anonymous vs authenticated actors based on Internet Identity and rebinds queries when identity/actor changes.",
    "Backend is a single Motoko canister with mixin-style composition (authorization mixin + blob-storage mixin).",
    "Role-based access control is centralized in `authorization/access-control.mo` and enforced across most shared/query methods via `hasPermission` checks.",
    "Offline/degenerate operation is first-class: many queries fall back to demo seed data when the backend actor is missing or methods are unavailable.",
    "Demo interactions for demo content are stored client-side in sessionStorage (likes/comments/purchases) to enable interactive demos without backend writes.",
    "Offline blueprint publishing persists a serializable subset of marketplace blueprint metadata in localStorage (BigInt/Principal-safe) and broadcasts an event to refresh React Query views.",
    "Media is represented as `ExternalBlob`; publish flows convert `File` uploads to bytes before sending to the canister in online mode.",
    "Connection UX is implemented via a dedicated `useActorConnection` hook + `ConnectionStatus` banner showing retries/success/error states.",
    "Calendar tasks are derived client-side by parsing JSON-encoded block content for `dailyStep` and `checklist` blocks and joining with localStorage completion state keyed by date."
  ],
  "known_issues": [
    "Backend `likePost` decrements a `Nat` (`post.likes - 1`) when unliking; if likes are 0 it can trap due to underflow.",
    "Several write APIs trust client-provided fields (e.g., `createPost` accepts client-supplied `id`, `author`, `createdAt`), enabling spoofing/inconsistent data without server-side normalization.",
    "Access control initialization traps if `CAFFEINE_ADMIN_TOKEN` is not set; authenticated actor initialization always calls `_initializeAccessControlWithSecret`, so misconfiguration can break authenticated usage.",
    "Follow/unfollow UI state in `ProfilePage` is tracked locally and not derived from backend state; follower/following counters in stored profiles are not updated by follow/unfollow operations, so counts/state can drift.",
    "Calendar page uses `useMemo` for a state-setting side effect (initializing enabled blueprints), which is an anti-pattern and may cause render-loop warnings; it should be `useEffect`.",
    "Blueprint visibility preferences utilities (`taskCompletionStorage.ts`) exist but are not wired into `CalendarPage`, so enabled/disabled blueprint filters are not persisted across sessions.",
    "Backend messaging APIs require `conversationParticipants` entries but there is no visible API to create/populate conversations, making messaging unusable without manual state seeding.",
    "Local (offline) published blueprints cannot persist `image`/`bannerImage` because `ExternalBlob`/`File` cannot be stored in localStorage; local marketplace items therefore lose media until republished online.",
    "Stripe checkout body builder uses `shipping_address_collection[allowed_countries][0]` for every configured country, so only one allowed country may be respected when multiple are provided.",
    "Backend maintains a global `ownershipRecords` map keyed by `blueprintId`, so later purchases overwrite earlier ones in that global map (though per-user `ownedBlueprints` tracking is also maintained)."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "Blueprint",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}